from lexer import *
from parser import *
from Interpreter import *
from syntax_tree import *

code = '''
소환!;

은교햄.변수(하나, 10);
은교햄.변수(하나, 210);
은교햄.변수(둘, 24);

은교햄.반복(0, 5, 1, 임시 i: 은교햄.출력(i));

은교햄.만약(1, 임시: 은교햄.출력("참"), 임시 : 은교햄.출력("거짓"));

은교햄.출력(하나);
은교햄.출력(둘);

은교햄.반복(0,4,1,임시: 은교햄.반복(0,4,1,임시: 은교햄.엔터없이출력("*")); 은교햄.출력());

은교햄.출력(하나 < 20);

은교햄.반복(0,10,1, 임시 ㅇ: 은교햄.만약(ㅇ < 5, 임시 ㅇ: 은교햄.엔터없이출력(ㅇ), 임시: 은교햄.엔터없이출력()));
은교햄.출력();

은교햄.반복(0,5,1, 임시: 은교햄.엔터없이출력("$"); 은교햄.출력());

은교햄.반복(0,10,1,
    임시 ㅇ : 은교햄.반복(0,10-ㅇ-1, 1, 임시 : 은교햄.엔터없이출력(" "));
            은교햄.반복(0,ㅇ*2-1, 1, 임시: 은교햄.엔터없이출력("*"));
            은교햄.출력());

은교햄.변수(ㅜ, 5);
은교햄.변수(ㅑ, 0);

은교햄.반복(1, ㅜ*2, 1,
    임시 ㅑㅌ:
        은교햄.만약(ㅑㅌ < ㅜ,
            임시: 은교햄.변수(ㅑ, ㅑㅌ),
            임시: 은교햄.변수(ㅑ, ㅜ*2-2-ㅑㅌ)
        );
        은교햄.반복(0, ㅜ*4-3, 1,
            임시 ㅓ:
                은교햄.만약(ㅑ == 0,
                    임시: 은교햄.만약(ㅓ < ㅜ || ㅓ > ㅜ*3-4,
                        임시: 은교햄.엔터없이출력("*"),
                        임시: 은교햄.엔터없이출력(" ")
                    ),
                    임시: 은교햄.만약(ㅓ == ㅑ || ㅓ == ㅑ + ㅜ - 1 || ㅓ == ㅜ * 3 - 3 - ㅑ || ㅓ == ㅜ * 4 - 4 - ㅑ,
                        임시: 은교햄.엔터없이출력("*"),
                        임시 : 은교햄.엔터없이출력(" ")
                        
                    )
                )
        );
        은교햄.출력()
);





'''

tokens = lexer(code)
asts = parse(tokens)
interpreter = Interpreter()
for ast in asts:
    interpreter.eval(ast)